podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SysTick_MKW41Z4.svd.xml
<!--
Devices using this peripheral: 
      MKW41Z4
-->
      <peripheral>
         <?sourceFile "SysTick_MKW41Z4" ?>
         <name>SYST</name>
         <description>System timer</description>
         <groupName>SysTick</groupName>
         <headerStructName>SysTick</headerStructName>
         <baseAddress>0xE000E010</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CSR</name>
               <description>SysTick Control and Status Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>no description available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>counter disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>counter enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TICKINT</name>
                     <description>no description available</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>counting down to 0 does not assert the SysTick exception request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>counting down to 0 asserts the SysTick exception request</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKSOURCE</name>
                     <description>no description available</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>external clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>processor clock</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COUNTFLAG</name>
                     <description>no description available</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RVR</name>
               <description>SysTick Reload Value Register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>Value to load into the SysTick Current Value Register when the counter reaches 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVR</name>
               <description>SysTick Current Value Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>CURRENT</name>
                     <description>Current value at the time the register is accessed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALIB</name>
               <description>SysTick Calibration Value Register</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TENMS</name>
                     <description>Reload value to use for 10ms timing</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>SKEW</name>
                     <description>no description available</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>10ms calibration value is exact</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>10ms calibration value is inexact, because of the clock frequency</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOREF</name>
                     <description>no description available</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The reference clock is provided</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The reference clock is not provided</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
